[  
  {
    "free": true,
    "name": "Convexity via Weak Distributive Laws",
    "authors": [
      "Filippo Bonchi",
      "Alessio Santamaria"
    ],
    "journal": "Logical Methods in Computer Science (Volume 18, Issue 4)",
    "year": 2022,
    "doi": "10.46298/lmcs-18(4:8)2022",
    "info": "Journal version of `Combining Semilattices and Semimodules'. On top of providing proofs and more detailed examples, we show how a natural candidate for a weak distributive law of the finite powerset monad over the semimodule monad fails to work, thus justifying our approach via the full powerset monad. Moreover, we show the existence of a weak extension of the powerset functor to Rel that is not locally monotone, proving then that there can be various weak distributive laws of the powerset monad over an arbitrary monad."
  },
  {
    "free": true,
    "name": "Bisimulation as a Logical Relation",
    "authors": [
      "Claudio Hermida",
      "Uday Reddy",
      "Edmund Robinson",
      "Alessio Santamaria"
    ],
    "journal": "Mathematical Structures in Computer Science, 2022",
    "year": 2022,
    "doi": "10.1017/S0960129522000020",
    "info": "We investigate how various forms of bisimulation can be characterised using the technology of logical relations. The approach taken is that each form of bisimulation corresponds to an algebraic structure derived from a transition system, and the general result is that a relation R between two transition systems on state spaces S and T is a bisimulation if and only if the derived algebraic structures are in the logical relation automatically generated from R. We show that this approach works for the original Park-Milner bisimulation and that it extends to weak bisimulation, and branching and semi-branching bisimulation. The paper concludes with a discussion of probabilistic bisimulation, where the situation is slightly more complex, partly owing to the need to encompass bisimulations that are not just relations."
  },
  {
    "free": true,
    "name": "On Doctrines and Cartesian Bicategories",
    "authors": [
      "Filippo Bonchi",
      "Jens Seeber",
      "Pawel Sobocinski",
      "Alessio Santamaria"
    ],
    "journal": "9th Conference on Algebra and Coalgebra in Computer Science (CALCO 2021).",
    "year": 2021,
    "doi": "10.4230/LIPIcs.CALCO.2021.10",
    "info": "We study the relationship between cartesian bicategories and a specialisation of Lawvere’s hyperdoctrines, namely elementary existential doctrines. Both provide different ways of abstracting the structural properties of logical systems: the former in algebraic terms based on a string diagrammatic calculus, the latter in universal terms using the fundamental notion of adjoint functor. We prove that these two approaches are related by an adjunction, which can be strengthened to an equivalence by imposing further constraints on doctrines."
  },
  {
    "free": true,
    "name": "Combining Semilattices and Semimodules",
    "authors": [
      "Filippo Bonchi",
      "Alessio Santamaria"
    ],
    "journal": "24th International Conference on the Foundations of Software Science and Computation Structures (FoSSaCS 2021)",
    "year": 2021,
    "doi": "10.1007/978-3-030-71995-1_6",
    "info": "We show how to compose the powerset monad with the S-semimodule monad, for a class of semirings S, by means of a canonical weak distributive law. This yields a new monad closely related to the monad of convex subsets introduced by Jacobs. We prove that the restriction of the composite monad to finitely generated convex subsets is presented by an algebraic theory combining semilattices and semimodules where sums and scalar products distribute over joins."
  },
  {
    "free": true,
    "name": "Composing Dinatural Transformations: Towards a Calculus of Substitution",
    "file": "Composing Dinatural Transformations",
    "authors": [
      "Guy McCusker",
      "Alessio Santamaria"
    ],
    "journal": "Journal of Pure and Applied Algebra (Volume 225, Issue 10)",
    "year": "2021",
    "doi": "10.1016/j.jpaa.2021.106689",
    "info": "We independently rediscover a theorem by Petric, that gives a sufficient and essentially necessary condition for two dinatural transformations to compose: acyclicity of certain graphs, which capture the dependency of the variables of the transformations. We use this to define a category of partially dinatural transformations, which are families of morphisms that are dinatural only in some of their variables; their associated graph is used to keep track of the dinaturality properties of their compositions. We also define a novel notion of horizontal composition, which we believe will yield a full calculus of substitution for dinatural transformations as sought by Kelly in the early 1970's. Most of the paper is distilled from my PhD thesis."
  },
  {
    "free": true,
    "name": "Frames and Topological Algebras for a Double-Power Monad",
    "authors": [
      "Giulia Frosoni",
      "Giuseppe Rosolini",
      "Alessio Santamaria"
    ],
    "journal": "Journal of Logic and Analysis (Volume 11)",
    "year": 2019,
    "doi": "10.4115/jla.2019.11.FT5",
    "info": "We study the relationship between the algebras for the double-power monad, given by the Sierpinski space over the category of Equilogical Spaces, and frames."
  },
  {
    "free": true,
    "name": "On Compositionality of Dinatural Transformations",
    "authors": [
      "Guy McCusker",
      "Alessio Santamaria"
    ],
    "journal": "27th EACSL Annual Conference on Computer Science Logic (CSL 2018)",
    "year": 2018,
    "doi": "10.4230/LIPIcs.CSL.2018.33",
    "info": "An introduction to vertical and horizontal composition of dinatural transformations."
  }
]
